package pax.TrainsSchedule.Model;

import java.util.ArrayList;

public class Station {

// [null,[["c213","Москва","г. Москва, Москва и Московская область, Россия"],
// ["s2000006","Москва (Белорусский вокзал)","вкз. Москва (Белорусский вокзал), Москва"],
// ["s2000003","Москва (Казанский вокзал)","вкз. Москва (Казанский вокзал), Москва"],
// ["s2000007","Москва (Киевский вокзал)","вкз. Москва (Киевский вокзал), Москва"],
// ["s2000001","Москва (Курский вокзал)","вкз. Москва (Курский вокзал), Москва"],
// ["s2006004","Москва (Ленинградский вокзал)","вкз. Москва (Ленинградский вокзал), Москва"],
// ["s2000005","Москва (Павелецкий вокзал)","вкз. Москва (Павелецкий вокзал), Москва"],
// ["s2000008","Москва (Рижский вокзал)","вкз. Москва (Рижский вокзал), Москва"],
// ["s2000009","Москва (Савёловский вокзал)","вкз. Москва (Савёловский вокзал), Москва"],
// ["s2000002","Москва (Ярославский вокзал)","вкз. Москва (Ярославский вокзал), Москва"],
// ["s9601018","Москва-3","пл. Москва-3, Москва"]]]
//
// ["c213","Москва","г. Москва, Москва и Московская область, Россия"],
// ["s2000006","Москва (Белорусский вокзал)","вкз. Москва (Белорусский вокзал), Москва"],
// ["s2000003","Москва (Казанский вокзал)","вкз. Москва (Казанский вокзал), Москва"],
// ["s2000007","Москва (Киевский вокзал)","вкз. Москва (Киевский вокзал), Москва"],
// ["s2000001","Москва (Курский вокзал)","вкз. Москва (Курский вокзал), Москва"],
// ["s2006004","Москва (Ленинградский вокзал)","вкз. Москва (Ленинградский вокзал), Москва"],
// ["s2000005","Москва (Павелецкий вокзал)","вкз. Москва (Павелецкий вокзал), Москва"],
// ["s2000008","Москва (Рижский вокзал)","вкз. Москва (Рижский вокзал), Москва"],
// ["s2000009","Москва (Савёловский вокзал)","вкз. Москва (Савёловский вокзал), Москва"],
// ["s2000002","Москва (Ярославский вокзал)","вкз. Москва (Ярославский вокзал), Москва"],
// ["s9601018","Москва-3","пл. Москва-3, Москва"]

    public String code;
    public String name;
    public String descr;

    public Station(String code, String name, String descr) {
        this.code = code;
        this.name = name;
        this.descr = descr;
    }

    public Station(String code, String name) {
        this(code, name, name);
    }

    public static class List extends ArrayList<Station> {
        public List(int capacity) {
            super(capacity);
        }

        public List() {
        }
    }

    public void clear() {
        code = "";
        name = "";
        descr = "";
    }
}
